### Import Library Needed

In [ ]:
import pandas as pd

## Load the datasets

In [532]:
df1 = pd.read_excel('D:/Test/kcda.xlsx', sheet_name  = "sarana_kesehatan")
df2 = pd.read_excel('D:/Test/kcda.xlsx', sheet_name  = "jumlah_sls")
df3 = pd.read_excel('D:/Test/kcda.xlsx', sheet_name  = "wabah_penyakit")
df4 = pd.read_excel('D:/Test/kcda.xlsx', sheet_name  = "wabah_meninggal")
df5 = pd.read_excel('D:/Test/kcda.xlsx', sheet_name  = "tempat_ibadah")
df6 = pd.read_excel('D:/Test/kcda.xlsx', sheet_name  = "lembaga_kemasyarakatan")
df7 = pd.read_excel('D:/Test/kcda.xlsx', sheet_name  = "bts")
df8 = pd.read_excel('D:/Test/kcda.xlsx', sheet_name  = "sinyal")
df9 = pd.read_excel('D:/Test/kcda.xlsx', sheet_name  = "pos")
df10 = pd.read_excel('D:/Test/kcda.xlsx', sheet_name  = "industri")
df11 = pd.read_excel('D:/Test/kcda.xlsx', sheet_name  = "perbankan")
df12 = pd.read_excel('D:/Test/kcda.xlsx', sheet_name  = "kud")
df13 = pd.read_excel('D:/Test/kcda.xlsx', sheet_name  = "sarana_prasarana")
df14 = pd.read_excel('D:/Test/kcda.xlsx', sheet_name  = "linmas")
df15 = pd.read_excel('D:/Test/kcda.xlsx', sheet_name  = "bumdes")

## Data Cleaning & Transformation

In [533]:
class Data_Transformation():
    @staticmethod
    def split_kecamatan(df):
        if 'nama_kecamatan' in df.columns and 'nama_desa' in df.columns:
            df.columns = df.columns.str.strip().str.lower().str.replace(' ', '_')
            return df
        else:
            rows = []
            kode = None
            nama_kecamatan = None
            
            for index, row in df.iterrows():
                kecamatan_value = str(row['Kecamatan'])
                if kecamatan_value.isdigit():
                    kode = kecamatan_value
                    
                    if index + 1 < len(df):
                        next_kecamatan = str(df.iloc[index + 1]['Kecamatan'])
                        
                        if not next_kecamatan.isdigit():
                            nama_kecamatan = next_kecamatan.upper()
                            
                else:
                    nama_desa = kecamatan_value.upper()
                    if not nama_desa.isdigit() and "GRAND TOTAL" not in nama_desa:
                        rows.append([kode, nama_kecamatan, nama_desa] + row[1:].tolist())
            
            transformed_df = pd.DataFrame(rows, columns=['kode', 'nama_kecamatan', 'nama_desa'] + df.columns[1:].tolist())
            transformed_df.columns = transformed_df.columns.str.strip().str.lower().str.replace(' ', '_')
            
            return transformed_df

    @staticmethod
    def remove_first_rows (transformed_df):
        if 'kode' in transformed_df.columns :
            first_rows = transformed_df.groupby('kode').head(1).index
            filtered_df = transformed_df.drop(first_rows)
            return filtered_df
        else :
            return transformed_df
            
    @staticmethod
    def remove_code (filtered_df):
        if 'kode' in filtered_df.columns :
            removecode_df = filtered_df.drop(columns=['kode'])
            return removecode_df
        else :
            return filtered_df

    @staticmethod
    def category(removecode_df, sheet_name):
        removecode_df['kategori'] = sheet_name
        columns = list(removecode_df.columns)
        if 'nama_desa' in columns:
            add_category = [col for col in columns if col != 'kategori']
            add_category.insert(add_category.index('nama_desa') + 1, 'kategori')
            add_category_df = removecode_df[add_category]
            return add_category_df
        else:
            return removecode_df

In [534]:
transformed_df1 = Data_Transformation.split_kecamatan(df1)
transformed_df2 = Data_Transformation.split_kecamatan(df2)
transformed_df3 = Data_Transformation.split_kecamatan(df3)
transformed_df4 = Data_Transformation.split_kecamatan(df4)
transformed_df5 = Data_Transformation.split_kecamatan(df5)
transformed_df6 = Data_Transformation.split_kecamatan(df6)
transformed_df7 = Data_Transformation.split_kecamatan(df7)
transformed_df8 = Data_Transformation.split_kecamatan(df8)
transformed_df9 = Data_Transformation.split_kecamatan(df9)
transformed_df10 = Data_Transformation.split_kecamatan(df10)
transformed_df11 = Data_Transformation.split_kecamatan(df11)
transformed_df12 = Data_Transformation.split_kecamatan(df12)
transformed_df13 = Data_Transformation.split_kecamatan(df13)
transformed_df14 = Data_Transformation.split_kecamatan(df14)
transformed_df15 = Data_Transformation.split_kecamatan(df15)

In [535]:
filtered_df1 = Data_Transformation.remove_first_rows(transformed_df1)
filtered_df2 = Data_Transformation.remove_first_rows(transformed_df2)
filtered_df3 = Data_Transformation.remove_first_rows(transformed_df3)
filtered_df4 = Data_Transformation.remove_first_rows(transformed_df4)
filtered_df5 = Data_Transformation.remove_first_rows(transformed_df5)
filtered_df6 = Data_Transformation.remove_first_rows(transformed_df6)
filtered_df7 = Data_Transformation.remove_first_rows(transformed_df7)
filtered_df8 = Data_Transformation.remove_first_rows(transformed_df8)
filtered_df9 = Data_Transformation.remove_first_rows(transformed_df9)
filtered_df10 = Data_Transformation.remove_first_rows(transformed_df10)
filtered_df11 = Data_Transformation.remove_first_rows(transformed_df11)
filtered_df12 = Data_Transformation.remove_first_rows(transformed_df12)
filtered_df13 = Data_Transformation.remove_first_rows(transformed_df13)
filtered_df14 = Data_Transformation.remove_first_rows(transformed_df14)
filtered_df15 = Data_Transformation.remove_first_rows(transformed_df15)

In [536]:
removecode_df1 = Data_Transformation.remove_code(filtered_df1)
removecode_df2 = Data_Transformation.remove_code(filtered_df2)
removecode_df3 = Data_Transformation.remove_code(filtered_df3)
removecode_df4 = Data_Transformation.remove_code(filtered_df4)
removecode_df5 = Data_Transformation.remove_code(filtered_df5)
removecode_df6 = Data_Transformation.remove_code(filtered_df6)
removecode_df7 = Data_Transformation.remove_code(filtered_df7)
removecode_df8 = Data_Transformation.remove_code(filtered_df8)
removecode_df9 = Data_Transformation.remove_code(filtered_df9)
removecode_df10 = Data_Transformation.remove_code(filtered_df10)
removecode_df11 = Data_Transformation.remove_code(filtered_df11)
removecode_df12 = Data_Transformation.remove_code(filtered_df12)
removecode_df13 = Data_Transformation.remove_code(filtered_df13)
removecode_df14 = Data_Transformation.remove_code(filtered_df14)
removecode_df15 = Data_Transformation.remove_code(filtered_df15)

In [537]:
add_category_df1 = Data_Transformation.category(removecode_df1, "sarana_kesehatan")
add_category_df2 = Data_Transformation.category(removecode_df2, "jumlah_sls")
add_category_df3 = Data_Transformation.category(removecode_df3, "wabah_penyakit")
add_category_df4 = Data_Transformation.category(removecode_df4, "wabah_meninggal")
add_category_df5 = Data_Transformation.category(removecode_df5, "tempat_ibadah")
add_category_df6 = Data_Transformation.category(removecode_df6, "lembaga_kemasyarakatan")
add_category_df7 = Data_Transformation.category(removecode_df7, "bts")
add_category_df8 = Data_Transformation.category(removecode_df8, "sinyal")
add_category_df9 = Data_Transformation.category(removecode_df9, "pos")
add_category_df10 = Data_Transformation.category(removecode_df10, "industri")
add_category_df11 = Data_Transformation.category(removecode_df11, "perbankan")
add_category_df12 = Data_Transformation.category(removecode_df12, "kud")
add_category_df13 = Data_Transformation.category(removecode_df13, "sarana_prasarana")
add_category_df14 = Data_Transformation.category(removecode_df14, "linmas")
add_category_df15 = Data_Transformation.category(removecode_df15, "bumdes")

## Check each dataset and clean

### Change to int function

In [572]:
def change_to_int (df) :
    exclude_columns = ['nama_kecamatan', 'nama_desa', 'kategori']
    columns_to_convert = [col for col in df.columns if col not in exclude_columns]
    df[columns_to_convert] = df[columns_to_convert].apply(pd.to_numeric, errors='coerce').fillna(0).astype(int)
    return df

### Sheet 1

In [538]:
add_category_df1.head(3)

,nama_kecamatan,nama_desa,kategori,rumah_sakit,rumah_sakit_bersalin,puskesmas_dengan_rawat_inap,puskesmas_tanpa_rawat_inap,pustu,poliklinik/_balai_pengobatan,praktik_dokter,rumah_bersalin,praktik_bidan,poskesdes,polindes,apotek,toko_khusus_obat/jamu
1,CIPATUJAH,BANTARKALONG,sarana_kesehatan,0,0,0,0,0,0,0,0,3,0,0,0,0
2,CIPATUJAH,CIANDUM,sarana_kesehatan,0,0,0,0,0,0,0,0,1,0,1,0,0
3,CIPATUJAH,CIHERAS,sarana_kesehatan,0,0,0,0,1,1,0,0,1,0,1,2,1

In [539]:
add_category_df1.isna().sum()

nama_kecamatan                  0
nama_desa                       0
kategori                        0
rumah_sakit                     0
rumah_sakit_bersalin            0
puskesmas_dengan_rawat_inap     0
puskesmas_tanpa_rawat_inap      0
pustu                           0
poliklinik/_balai_pengobatan    0
praktik_dokter                  0
rumah_bersalin                  0
praktik_bidan                   0
poskesdes                       0
polindes                        0
apotek                          0
toko_khusus_obat/jamu           0
dtype: int64

In [540]:
add_category_df1['nama_kecamatan'].unique(), add_category_df1['nama_kecamatan'].nunique()

(array(['CIPATUJAH', 'KARANGNUNGGAL', 'CIKALONG', 'PANCATENGAH',
        'CIKATOMAS', 'CIBALONG', 'PARUNGPONTENG', 'BANTARKALONG',
        'BOJONGASIH', 'CULAMEGA', 'BOJONGGAMBIR', 'SODONGHILIR', 'TARAJU',
        'SALAWU', 'PUSPAHIANG', 'TANJUNGJAYA', 'SUKARAJA', 'SALOPA',
        'JATIWARAS', 'CINEAM', 'KARANGJAYA', 'MANONJAYA', 'GUNUNGTANJUNG',
        'SINGAPARNA', 'SUKARAME', 'MANGUNREJA', 'CIGALONTANG', 'LEUWISARI',
        'SARIWANGI', 'PADAKEMBANG', 'SUKARATU', 'CISAYONG', 'SUKAHENING',
        'RAJAPOLAH', 'JAMANIS', 'CIAWI', 'KADIPATEN', 'PAGERAGEUNG',
        'SUKARESIK'], dtype=object),
 39)

In [560]:
add_category_df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 351 entries, 1 to 389
Data columns (total 16 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   nama_kecamatan                351 non-null    object
 1   nama_desa                     351 non-null    object
 2   kategori                      351 non-null    object
 3   rumah_sakit                   351 non-null    int64
 4   rumah_sakit_bersalin          351 non-null    int64
 5   puskesmas_dengan_rawat_inap   351 non-null    int64
 6   puskesmas_tanpa_rawat_inap    351 non-null    int64
 7   pustu                         351 non-null    int64
 8   poliklinik/_balai_pengobatan  351 non-null    int64
 9   praktik_dokter                351 non-null    int64
 10  rumah_bersalin                351 non-null    int64
 11  praktik_bidan                 351 non-null    int64
 12  poskesdes                     351 non-null    int64
 13  polindes                      351 non-null    int64
 14  apotek                        351 non-null    int64
 15  toko_khusus_obat/jamu         351 non-null    int64
dtypes: int64(13), object(3)
memory usage: 46.6+ KB

### Sheet 2

In [541]:
add_category_df2.head(3)

,nama_kecamatan,nama_desa,kategori,jumlah_sls_terkecil,unnamed:_2,unnamed:_3,unnamed:_4,unnamed:_5
1,CIPATUJAH,BANTARKALONG,jumlah_sls,25,NaN,NaN,NaN,NaN
2,CIPATUJAH,CIANDUM,jumlah_sls,35,NaN,NaN,NaN,NaN
3,CIPATUJAH,CIHERAS,jumlah_sls,42,NaN,NaN,NaN,NaN

In [542]:
add_category_df2.isna().sum()

nama_kecamatan           0
nama_desa                0
kategori                 0
jumlah_sls_terkecil      0
unnamed:_2             351
unnamed:_3             351
unnamed:_4             350
unnamed:_5             350
dtype: int64

In [543]:
add_category_df2 = add_category_df2.dropna(axis=1)

In [556]:
add_category_df2.head(3)

  nama_kecamatan     nama_desa    kategori  jumlah_sls_terkecil
1      CIPATUJAH  BANTARKALONG  jumlah_sls                   25
2      CIPATUJAH       CIANDUM  jumlah_sls                   35
3      CIPATUJAH       CIHERAS  jumlah_sls                   42

In [561]:
add_category_df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 351 entries, 1 to 389
Data columns (total 4 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   nama_kecamatan       351 non-null    object
 1   nama_desa            351 non-null    object
 2   kategori             351 non-null    object
 3   jumlah_sls_terkecil  351 non-null    int64
dtypes: int64(1), object(3)
memory usage: 13.7+ KB

### Sheet 3

In [557]:
add_category_df3.head()

,nama_kecamatan,nama_desa,kategori,muntaber/diare,demam_berdarah,campak,malaria,flu_burung/_sars,hepatitis_e,difteri,corona/_covid-19,kerawanan_pangan,lainnya
1,CIPATUJAH,BANTARKALONG,wabah_penyakit,0,0,0,0,0,0,0,1,0,0
2,CIPATUJAH,CIANDUM,wabah_penyakit,0,0,0,0,0,0,0,0,0,0
3,CIPATUJAH,CIHERAS,wabah_penyakit,0,0,0,0,0,0,0,2,0,0
4,CIPATUJAH,CIKAWUNGADING,wabah_penyakit,0,0,0,0,0,0,0,0,0,0
5,CIPATUJAH,CIPANAS,wabah_penyakit,0,0,0,0,0,0,0,3,0,0

In [562]:
add_category_df3.isna().sum()

nama_kecamatan      0
nama_desa           0
kategori            0
muntaber/diare      0
demam_berdarah      0
campak              0
malaria             0
flu_burung/_sars    0
hepatitis_e         0
difteri             0
corona/_covid-19    0
kerawanan_pangan    0
lainnya             0
dtype: int64

In [563]:
add_category_df3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 351 entries, 1 to 389
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   nama_kecamatan    351 non-null    object
 1   nama_desa         351 non-null    object
 2   kategori          351 non-null    object
 3   muntaber/diare    351 non-null    int64
 4   demam_berdarah    351 non-null    int64
 5   campak            351 non-null    int64
 6   malaria           351 non-null    int64
 7   flu_burung/_sars  351 non-null    int64
 8   hepatitis_e       351 non-null    int64
 9   difteri           351 non-null    int64
 10  corona/_covid-19  351 non-null    int64
 11  kerawanan_pangan  351 non-null    int64
 12  lainnya           351 non-null    int64
dtypes: int64(10), object(3)
memory usage: 38.4+ KB

### Sheet 4

In [566]:
add_category_df4.head()

,nama_kecamatan,nama_desa,kategori,muntaber/diare,demam_berdarah,campak,malaria,flu_burung/_sars,hepatitis_e,difteri,corona/_covid-19,kerawanan_pangan,lainnya
1,CIPATUJAH,BANTARKALONG,wabah_meninggal,0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,CIPATUJAH,CIANDUM,wabah_meninggal,0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,CIPATUJAH,CIHERAS,wabah_meninggal,0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,CIPATUJAH,CIKAWUNGADING,wabah_meninggal,0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
5,CIPATUJAH,CIPANAS,wabah_meninggal,0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [567]:
add_category_df4.isna().sum()

nama_kecamatan      0
nama_desa           0
kategori            0
muntaber/diare      0
demam_berdarah      0
campak              0
malaria             0
flu_burung/_sars    0
hepatitis_e         0
difteri             0
corona/_covid-19    0
kerawanan_pangan    0
lainnya             0
dtype: int64

In [545]:
add_category_df4.info()

<class 'pandas.core.frame.DataFrame'>
Index: 351 entries, 1 to 389
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   nama_kecamatan    351 non-null    object
 1   nama_desa         351 non-null    object
 2   kategori          351 non-null    object
 3   muntaber/diare    351 non-null    object
 4   demam_berdarah    351 non-null    float64
 5   campak            351 non-null    float64
 6   malaria           351 non-null    float64
 7   flu_burung/_sars  351 non-null    float64
 8   hepatitis_e       351 non-null    float64
 9   difteri           351 non-null    float64
 10  corona/_covid-19  351 non-null    float64
 11  kerawanan_pangan  351 non-null    float64
 12  lainnya           351 non-null    float64
dtypes: float64(9), object(4)
memory usage: 38.4+ KB

In [573]:
add_category_df4 = change_to_int(add_category_df4)

In [574]:
add_category_df4.info()

<class 'pandas.core.frame.DataFrame'>
Index: 351 entries, 1 to 389
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   nama_kecamatan    351 non-null    object
 1   nama_desa         351 non-null    object
 2   kategori          351 non-null    object
 3   muntaber/diare    351 non-null    int64
 4   demam_berdarah    351 non-null    int64
 5   campak            351 non-null    int64
 6   malaria           351 non-null    int64
 7   flu_burung/_sars  351 non-null    int64
 8   hepatitis_e       351 non-null    int64
 9   difteri           351 non-null    int64
 10  corona/_covid-19  351 non-null    int64
 11  kerawanan_pangan  351 non-null    int64
 12  lainnya           351 non-null    int64
dtypes: int64(10), object(3)
memory usage: 38.4+ KB

In [575]:
add_category_df4.head()

,nama_kecamatan,nama_desa,kategori,muntaber/diare,demam_berdarah,campak,malaria,flu_burung/_sars,hepatitis_e,difteri,corona/_covid-19,kerawanan_pangan,lainnya
1,CIPATUJAH,BANTARKALONG,wabah_meninggal,0,0,0,0,0,0,0,0,0,0
2,CIPATUJAH,CIANDUM,wabah_meninggal,0,0,0,0,0,0,0,0,0,0
3,CIPATUJAH,CIHERAS,wabah_meninggal,0,0,0,0,0,0,0,0,0,0
4,CIPATUJAH,CIKAWUNGADING,wabah_meninggal,0,0,0,0,0,0,0,0,0,0
5,CIPATUJAH,CIPANAS,wabah_meninggal,0,0,0,0,0,0,0,0,0,0

### Sheet 5

In [576]:
add_category_df5.head()

,nama_kecamatan,nama_desa,kategori,masjid,surau/_langgar/_mushola,gereja_kristen,gereja_katolik,kapel,pura,wihara,kelenteng,balai_basarah,lainnya
1,CIPATUJAH,BANTARKALONG,tempat_ibadah,8,25,0,0,0,0,0,0,0,0
2,CIPATUJAH,CIANDUM,tempat_ibadah,16,35,0,0,0,0,0,0,0,0
3,CIPATUJAH,CIHERAS,tempat_ibadah,10,32,0,0,0,0,0,0,0,0
4,CIPATUJAH,CIKAWUNGADING,tempat_ibadah,22,55,1,0,0,0,0,0,0,0
5,CIPATUJAH,CIPANAS,tempat_ibadah,10,22,1,0,0,0,0,0,0,0

In [580]:
add_category_df4.isna().sum()

nama_kecamatan      0
nama_desa           0
kategori            0
muntaber/diare      0
demam_berdarah      0
campak              0
malaria             0
flu_burung/_sars    0
hepatitis_e         0
difteri             0
corona/_covid-19    0
kerawanan_pangan    0
lainnya             0
dtype: int64

In [579]:
add_category_df5.info()

<class 'pandas.core.frame.DataFrame'>
Index: 351 entries, 1 to 389
Data columns (total 13 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   nama_kecamatan           351 non-null    object
 1   nama_desa                351 non-null    object
 2   kategori                 351 non-null    object
 3   masjid                   351 non-null    int64
 4   surau/_langgar/_mushola  351 non-null    int64
 5   gereja_kristen           351 non-null    int64
 6   gereja_katolik           351 non-null    int64
 7   kapel                    351 non-null    int64
 8   pura                     351 non-null    int64
 9   wihara                   351 non-null    int64
 10  kelenteng                351 non-null    int64
 11  balai_basarah            351 non-null    int64
 12  lainnya                  351 non-null    int64
dtypes: int64(10), object(3)
memory usage: 38.4+ KB

### Sheet 6

In [581]:
add_category_df6.head()

,nama_kecamatan,nama_desa,kategori,pkk,karang_taruna,lembaga_adat,kelompok_tani,lembaga_pengelolaan_air,kelompok_masyarakat_(pokmas)
1,CIPATUJAH,BANTARKALONG,lembaga_kemasyarakatan,4,1,1,8,1,0
2,CIPATUJAH,CIANDUM,lembaga_kemasyarakatan,1,1,0,9,0,0
3,CIPATUJAH,CIHERAS,lembaga_kemasyarakatan,1,8,0,6,1,1
4,CIPATUJAH,CIKAWUNGADING,lembaga_kemasyarakatan,1,1,0,4,0,2
5,CIPATUJAH,CIPANAS,lembaga_kemasyarakatan,1,1,0,3,0,0

In [582]:
add_category_df6.isna().sum()

nama_kecamatan                  0
nama_desa                       0
kategori                        0
pkk                             0
karang_taruna                   0
lembaga_adat                    0
kelompok_tani                   0
lembaga_pengelolaan_air         0
kelompok_masyarakat_(pokmas)    0
dtype: int64

In [584]:
add_category_df6.info()

<class 'pandas.core.frame.DataFrame'>
Index: 351 entries, 1 to 389
Data columns (total 9 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   nama_kecamatan                351 non-null    object
 1   nama_desa                     351 non-null    object
 2   kategori                      351 non-null    object
 3   pkk                           351 non-null    int64
 4   karang_taruna                 351 non-null    int64
 5   lembaga_adat                  351 non-null    int64
 6   kelompok_tani                 351 non-null    int64
 7   lembaga_pengelolaan_air       351 non-null    int64
 8   kelompok_masyarakat_(pokmas)  351 non-null    int64
dtypes: int64(6), object(3)
memory usage: 27.4+ KB

### Sheet 7

In [585]:
add_category_df7.head()

  nama_kecamatan     nama_desa kategori  bts  operator_layanan_seluler
0      CIPATUJAH       CIHERAS      bts    2                       3.0
1      CIPATUJAH       CIPANAS      bts    1                       4.0
2      CIPATUJAH       CIANDUM      bts    1                       4.0
3      CIPATUJAH     CIPATUJAH      bts    3                       3.0
4      CIPATUJAH  SINDANGKERTA      bts    3                       3.0

In [589]:
add_category_df7.isna().sum()

nama_kecamatan              1
nama_desa                   1
kategori                    0
bts                         0
operator_layanan_seluler    1
dtype: int64

In [591]:
add_category_df7.isna()

     nama_kecamatan  nama_desa  kategori    bts  operator_layanan_seluler
0             False      False     False  False                     False
1             False      False     False  False                     False
2             False      False     False  False                     False
3             False      False     False  False                     False
4             False      False     False  False                     False
..              ...        ...       ...    ...                       ...
347           False      False     False  False                     False
348           False      False     False  False                     False
349           False      False     False  False                     False
350           False      False     False  False                     False
351            True       True     False  False                      True

[352 rows x 5 columns]

In [595]:
add_category_df7 = add_category_df7.dropna()

In [600]:
add_category_df7 = change_to_int(add_category_df7)

In [601]:
add_category_df7.head()

  nama_kecamatan     nama_desa kategori  bts  operator_layanan_seluler
0      CIPATUJAH       CIHERAS      bts    2                         3
1      CIPATUJAH       CIPANAS      bts    1                         4
2      CIPATUJAH       CIANDUM      bts    1                         4
3      CIPATUJAH     CIPATUJAH      bts    3                         3
4      CIPATUJAH  SINDANGKERTA      bts    3                         3

In [603]:
add_category_df7.isna().sum()

nama_kecamatan              0
nama_desa                   0
kategori                    0
bts                         0
operator_layanan_seluler    0
dtype: int64

In [602]:
add_category_df7.info()

<class 'pandas.core.frame.DataFrame'>
Index: 351 entries, 0 to 350
Data columns (total 5 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   nama_kecamatan            351 non-null    object
 1   nama_desa                 351 non-null    object
 2   kategori                  351 non-null    object
 3   bts                       351 non-null    int64
 4   operator_layanan_seluler  351 non-null    int64
dtypes: int64(2), object(3)
memory usage: 16.5+ KB

### Sheet 8

In [546]:
add_category_df8.head()

  nama_kecamatan     nama_desa kategori      sinyal_telepon sinyal_internet
0      CIPATUJAH       CIHERAS   sinyal  Sinyal Sangat Kuat          4G/LTE
1      CIPATUJAH       CIPANAS   sinyal         Sinyal Kuat          4G/LTE
2      CIPATUJAH       CIANDUM   sinyal         Sinyal Kuat          4G/LTE
3      CIPATUJAH     CIPATUJAH   sinyal         Sinyal Kuat          4G/LTE
4      CIPATUJAH  SINDANGKERTA   sinyal         Sinyal Kuat          4G/LTE

In [547]:
add_category_df8['sinyal_telepon'].unique()

array(['Sinyal Sangat Kuat', 'Sinyal Kuat', 'Tidak Digunakan',
       'Tidak Ada Sinyal'], dtype=object)

In [548]:
add_category_df8['sinyal_internet'].unique()

array(['4G/LTE', '2,5G/E/GPRSG/H/H+/EVDO', 4, 'Tidak Ada Sinyal Internet'],
      dtype=object)

In [558]:
add_category_df8['sinyal_telepon']= add_category_df8['sinyal_telepon'].replace({
    'Sinyal Sangat Kuat': 2,
    'Sinyal Kuat': 1,
    'Tidak Digunakan': 0,
    'Tidak Ada Sinyal': 0    
}).astype(int)

In [550]:
add_category_df8.head(3)

  nama_kecamatan nama_desa kategori  sinyal_telepon sinyal_internet
0      CIPATUJAH   CIHERAS   sinyal               2          4G/LTE
1      CIPATUJAH   CIPANAS   sinyal               1          4G/LTE
2      CIPATUJAH   CIANDUM   sinyal               1          4G/LTE

In [551]:
add_category_df8['sinyal_internet'] = add_category_df8['sinyal_internet'].replace(4, "4G/LTE")

In [552]:
add_category_df8['sinyal_internet'].unique()

array(['4G/LTE', '2,5G/E/GPRSG/H/H+/EVDO', 'Tidak Ada Sinyal Internet'],
      dtype=object)

In [559]:
add_category_df8['sinyal_internet']= add_category_df8['sinyal_internet'].replace({
    '4G/LTE': 2,
    '2,5G/E/GPRSG/H/H+/EVDO': 1,
    'Tidak Ada Sinyal Internet': 0  
}).astype(int)

In [554]:
add_category_df8.head(3)

  nama_kecamatan nama_desa kategori  sinyal_telepon  sinyal_internet
0      CIPATUJAH   CIHERAS   sinyal               2                2
1      CIPATUJAH   CIPANAS   sinyal               1                2
2      CIPATUJAH   CIANDUM   sinyal               1                2

In [605]:
add_category_df8.isna().sum()

nama_kecamatan     0
nama_desa          0
kategori           0
sinyal_telepon     0
sinyal_internet    0
dtype: int64

In [606]:
add_category_df8.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 351 entries, 0 to 350
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   nama_kecamatan   351 non-null    object
 1   nama_desa        351 non-null    object
 2   kategori         351 non-null    object
 3   sinyal_telepon   351 non-null    int64
 4   sinyal_internet  351 non-null    int64
dtypes: int64(2), object(3)
memory usage: 13.8+ KB

### Sheet 9

In [607]:
add_category_df9.head()

  nama_kecamatan     nama_desa kategori         pos pos_keliling   ekspedisi
0      CIPATUJAH       CIHERAS      pos   Tidak Ada    Tidak Ada   Tidak Ada
1      CIPATUJAH       CIPANAS      pos   Tidak Ada          Ada   Tidak Ada
2      CIPATUJAH       CIANDUM      pos   Tidak Ada    Tidak Ada   Tidak Ada
3      CIPATUJAH     CIPATUJAH      pos  Beroperasi          Ada  Beroperasi
4      CIPATUJAH  SINDANGKERTA      pos   Tidak Ada          Ada   Tidak Ada

In [608]:
add_category_df9['pos'].unique(), add_category_df9['pos_keliling'].unique(),add_category_df9['ekspedisi'].unique()

(array(['Tidak Ada', 'Beroperasi'], dtype=object),
 array(['Tidak Ada', 'Ada'], dtype=object),
 array(['Tidak Ada', 'Beroperasi', 'Jarang Beroperasi'], dtype=object))

In [612]:
add_category_df9['pos']= add_category_df9['pos'].replace({
    'Beroperasi': 1,
    'Tidak Ada': 0  
}).astype(int)

In [614]:
add_category_df9['pos_keliling']= add_category_df9['pos_keliling'].replace({
    'Ada': 1,
    'Tidak Ada': 0  
}).astype(int)

In [616]:
add_category_df9['ekspedisi']= add_category_df9['ekspedisi'].replace({
    'Beroperasi': 2,
    'Jarang Beroperasi' : 1,
    'Tidak Ada': 0  
}).astype(int)

In [617]:
add_category_df9.head()

  nama_kecamatan     nama_desa kategori  pos  pos_keliling  ekspedisi
0      CIPATUJAH       CIHERAS      pos    0             0          0
1      CIPATUJAH       CIPANAS      pos    0             1          0
2      CIPATUJAH       CIANDUM      pos    0             0          0
3      CIPATUJAH     CIPATUJAH      pos    1             1          2
4      CIPATUJAH  SINDANGKERTA      pos    0             1          0

In [618]:
add_category_df9.isna().sum()

nama_kecamatan    0
nama_desa         0
kategori          0
pos               0
pos_keliling      0
ekspedisi         0
dtype: int64

In [619]:
add_category_df9.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 351 entries, 0 to 350
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   nama_kecamatan  351 non-null    object
 1   nama_desa       351 non-null    object
 2   kategori        351 non-null    object
 3   pos             351 non-null    int64
 4   pos_keliling    351 non-null    int64
 5   ekspedisi       351 non-null    int64
dtypes: int64(3), object(3)
memory usage: 16.6+ KB

### Sheet 10

In [620]:
add_category_df10.head()

,nama_kecamatan,nama_desa,kategori,kulit,furnitur,barang_logan,tekstil,pak_jadi,galian_nonlogam,kayu,makanan,minuman,olah_tembakau,kertas,percetakan,alat_angkut,kerajinan,reparasi,lainnya
0,CIPATUJAH,CIHERAS,industri,0,3,1,0,1,0,1,14,2,0,0,0,0,1,0,2
1,CIPATUJAH,CIPANAS,industri,0,2,0,0,0,0,0,1,0,0,0,0,0,0,1,0
2,CIPATUJAH,CIANDUM,industri,0,0,0,0,5,0,0,24,24,0,0,0,0,0,5,0
3,CIPATUJAH,CIPATUJAH,industri,0,3,0,0,3,5,5,20,20,0,0,0,0,0,1,0
4,CIPATUJAH,SINDANGKERTA,industri,0,6,0,0,3,12,0,66,66,0,0,0,0,2,0,0

In [623]:
add_category_df10.isna().sum()

nama_kecamatan     0
nama_desa          0
kategori           0
kulit              0
furnitur           0
barang_logan       0
tekstil            0
pak_jadi           0
galian_nonlogam    0
kayu               0
makanan            0
minuman            0
olah_tembakau      0
kertas             0
percetakan         0
alat_angkut        0
kerajinan          0
reparasi           0
lainnya            0
dtype: int64

In [624]:
add_category_df10.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 351 entries, 0 to 350
Data columns (total 19 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   nama_kecamatan   351 non-null    object
 1   nama_desa        351 non-null    object
 2   kategori         351 non-null    object
 3   kulit            351 non-null    int64
 4   furnitur         351 non-null    int64
 5   barang_logan     351 non-null    int64
 6   tekstil          351 non-null    int64
 7   pak_jadi         351 non-null    int64
 8   galian_nonlogam  351 non-null    int64
 9   kayu             351 non-null    int64
 10  makanan          351 non-null    int64
 11  minuman          351 non-null    int64
 12  olah_tembakau    351 non-null    int64
 13  kertas           351 non-null    int64
 14  percetakan       351 non-null    int64
 15  alat_angkut      351 non-null    int64
 16  kerajinan        351 non-null    int64
 17  reparasi         351 non-null    int64
 18  lainnya          351 non-null    int64
dtypes: int64(16), object(3)
memory usage: 52.2+ KB

### Sheet 11

In [625]:
add_category_df11.head()

  nama_kecamatan     nama_desa   kategori  bank_pemerintah  bank_swasta  bpr
0      CIPATUJAH       CIHERAS  perbankan                0            0    0
1      CIPATUJAH       CIPANAS  perbankan                0            0    0
2      CIPATUJAH       CIANDUM  perbankan                0            0    0
3      CIPATUJAH     CIPATUJAH  perbankan                1            1    1
4      CIPATUJAH  SINDANGKERTA  perbankan                0            0    0

In [636]:
add_category_df11.isna().sum()

nama_kecamatan     0
nama_desa          0
kategori           0
bank_pemerintah    0
bank_swasta        0
bpr                0
dtype: int64

In [637]:
add_category_df11.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 351 entries, 0 to 350
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   nama_kecamatan   351 non-null    object
 1   nama_desa        351 non-null    object
 2   kategori         351 non-null    object
 3   bank_pemerintah  351 non-null    int64
 4   bank_swasta      351 non-null    int64
 5   bpr              351 non-null    int64
dtypes: int64(3), object(3)
memory usage: 16.6+ KB

### Sheet 12

In [629]:
add_category_df12.head()

  nama_kecamatan     nama_desa kategori  kud  ind_kecil  kospin  lainnya
0      CIPATUJAH       CIHERAS      kud    0          0       0        0
1      CIPATUJAH       CIPANAS      kud    0          0       0        0
2      CIPATUJAH       CIANDUM      kud    0          0       0        0
3      CIPATUJAH     CIPATUJAH      kud    0          0       0        0
4      CIPATUJAH  SINDANGKERTA      kud    0          0       0        0

In [634]:
add_category_df12.isna().sum()

nama_kecamatan    1
nama_desa         1
kategori          0
kud               0
ind_kecil         0
kospin            0
lainnya           0
dtype: int64

In [638]:
add_category_df12.isna()

     nama_kecamatan  nama_desa  kategori    kud  ind_kecil  kospin  lainnya
0             False      False     False  False      False   False    False
1             False      False     False  False      False   False    False
2             False      False     False  False      False   False    False
3             False      False     False  False      False   False    False
4             False      False     False  False      False   False    False
..              ...        ...       ...    ...        ...     ...      ...
347           False      False     False  False      False   False    False
348           False      False     False  False      False   False    False
349           False      False     False  False      False   False    False
350           False      False     False  False      False   False    False
351            True       True     False  False      False   False    False

[352 rows x 7 columns]

In [639]:
add_category_df12 = add_category_df12.dropna()

In [641]:
add_category_df12.isna().sum()

nama_kecamatan    0
nama_desa         0
kategori          0
kud               0
ind_kecil         0
kospin            0
lainnya           0
dtype: int64

In [642]:
add_category_df12.info()

<class 'pandas.core.frame.DataFrame'>
Index: 351 entries, 0 to 350
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   nama_kecamatan  351 non-null    object
 1   nama_desa       351 non-null    object
 2   kategori        351 non-null    object
 3   kud             351 non-null    int64
 4   ind_kecil       351 non-null    int64
 5   kospin          351 non-null    int64
 6   lainnya         351 non-null    int64
dtypes: int64(4), object(3)
memory usage: 21.9+ KB

### Sheet 13

In [633]:
add_category_df13.head()

,nama_kecamatan,nama_desa,kategori,pertokoan,pasar_permanen,semi_permanen,non_bangunan,minimarket,resto/rm,wr_makan,hotel,penginapan,tk_kelontong
0,CIPATUJAH,CIHERAS,sarana_prasarana,1,1,0,0,0,2,17,0,0,117
1,CIPATUJAH,CIPANAS,sarana_prasarana,0,0,0,0,0,0,2,0,0,36
2,CIPATUJAH,CIANDUM,sarana_prasarana,0,0,0,0,0,0,10,0,0,64
3,CIPATUJAH,CIPATUJAH,sarana_prasarana,0,0,1,0,2,0,40,0,3,130
4,CIPATUJAH,SINDANGKERTA,sarana_prasarana,0,0,1,0,1,0,45,0,7,122

In [643]:
add_category_df13.isna().sum()

nama_kecamatan    0
nama_desa         0
kategori          0
pertokoan         0
pasar_permanen    0
semi_permanen     0
non_bangunan      0
minimarket        0
resto/rm          0
wr_makan          0
hotel             0
penginapan        0
tk_kelontong      0
dtype: int64

In [644]:
add_category_df13.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 351 entries, 0 to 350
Data columns (total 13 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   nama_kecamatan  351 non-null    object
 1   nama_desa       351 non-null    object
 2   kategori        351 non-null    object
 3   pertokoan       351 non-null    int64
 4   pasar_permanen  351 non-null    int64
 5   semi_permanen   351 non-null    int64
 6   non_bangunan    351 non-null    int64
 7   minimarket      351 non-null    int64
 8   resto/rm        351 non-null    int64
 9   wr_makan        351 non-null    int64
 10  hotel           351 non-null    int64
 11  penginapan      351 non-null    int64
 12  tk_kelontong    351 non-null    int64
dtypes: int64(10), object(3)
memory usage: 35.8+ KB

### Sheet 14

In [645]:
add_category_df14.head()

  nama_kecamatan     nama_desa kategori  linmas
0      CIPATUJAH       CIHERAS   linmas      24
1      CIPATUJAH       CIPANAS   linmas      22
2      CIPATUJAH       CIANDUM   linmas      25
3      CIPATUJAH     CIPATUJAH   linmas      20
4      CIPATUJAH  SINDANGKERTA   linmas      20

In [646]:
add_category_df14.isna().sum()

nama_kecamatan    1
nama_desa         1
kategori          0
linmas            0
dtype: int64

In [647]:
add_category_df14 = add_category_df14.dropna()

In [648]:
add_category_df14.isna().sum()

nama_kecamatan    0
nama_desa         0
kategori          0
linmas            0
dtype: int64

In [649]:
add_category_df14.info()

<class 'pandas.core.frame.DataFrame'>
Index: 351 entries, 0 to 350
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   nama_kecamatan  351 non-null    object
 1   nama_desa       351 non-null    object
 2   kategori        351 non-null    object
 3   linmas          351 non-null    int64
dtypes: int64(1), object(3)
memory usage: 13.7+ KB

### Sheet 15

In [650]:
add_category_df15.head()

  nama_kecamatan     nama_desa kategori  bumdes
0      CIPATUJAH       CIHERAS   bumdes       1
1      CIPATUJAH       CIPANAS   bumdes       1
2      CIPATUJAH       CIANDUM   bumdes       1
3      CIPATUJAH     CIPATUJAH   bumdes       1
4      CIPATUJAH  SINDANGKERTA   bumdes       1

In [651]:
add_category_df15.isna().sum()

nama_kecamatan    0
nama_desa         0
kategori          0
bumdes            0
dtype: int64

In [652]:
add_category_df15.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 351 entries, 0 to 350
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   nama_kecamatan  351 non-null    object
 1   nama_desa       351 non-null    object
 2   kategori        351 non-null    object
 3   bumdes          351 non-null    int64
dtypes: int64(1), object(3)
memory usage: 11.1+ KB

## TRANSFORM TO LONG DATA

In [654]:
def long_data (df) :
    long_df = pd.melt (
        df,
        id_vars=['nama_kecamatan', 'nama_desa', 'kategori'],
        var_name='jenis',
        value_name = 'jumlah'
    )

    return long_df

In [655]:
long_df1 = long_data(add_category_df1)
long_df2 = long_data(add_category_df2)
long_df3 = long_data(add_category_df3)
long_df4 = long_data(add_category_df4)
long_df5 = long_data(add_category_df5)
long_df6 = long_data(add_category_df6)
long_df7 = long_data(add_category_df7)
long_df8 = long_data(add_category_df8)
long_df9 = long_data(add_category_df9)
long_df10 = long_data(add_category_df10)
long_df11 = long_data(add_category_df11)
long_df12 = long_data(add_category_df12)
long_df13 = long_data(add_category_df13)
long_df14 = long_data(add_category_df14)
long_df15 = long_data(add_category_df15)

In [656]:
long_df1.head()

  nama_kecamatan      nama_desa          kategori        jenis  jumlah
0      CIPATUJAH   BANTARKALONG  sarana_kesehatan  rumah_sakit       0
1      CIPATUJAH        CIANDUM  sarana_kesehatan  rumah_sakit       0
2      CIPATUJAH        CIHERAS  sarana_kesehatan  rumah_sakit       0
3      CIPATUJAH  CIKAWUNGADING  sarana_kesehatan  rumah_sakit       0
4      CIPATUJAH        CIPANAS  sarana_kesehatan  rumah_sakit       0

## Merge Data

In [670]:
dfs = [
    long_df1, 
    long_df2, 
    long_df3, 
    long_df4, 
    long_df5, 
    long_df6, 
    long_df7, 
    long_df8, 
    long_df9, 
    long_df10, 
    long_df11, 
    long_df12, 
    long_df13, 
    long_df14, 
    long_df15
]

In [671]:
merged_df = pd.concat(dfs, ignore_index=True)

In [674]:
merged_df.shape

(32292, 5)

In [677]:
merged_df['nama_kecamatan'].unique(), merged_df['nama_kecamatan'].nunique()

(array(['CIPATUJAH', 'KARANGNUNGGAL', 'CIKALONG', 'PANCATENGAH',
        'CIKATOMAS', 'CIBALONG', 'PARUNGPONTENG', 'BANTARKALONG',
        'BOJONGASIH', 'CULAMEGA', 'BOJONGGAMBIR', 'SODONGHILIR', 'TARAJU',
        'SALAWU', 'PUSPAHIANG', 'TANJUNGJAYA', 'SUKARAJA', 'SALOPA',
        'JATIWARAS', 'CINEAM', 'KARANGJAYA', 'MANONJAYA', 'GUNUNGTANJUNG',
        'SINGAPARNA', 'SUKARAME', 'MANGUNREJA', 'CIGALONTANG', 'LEUWISARI',
        'SARIWANGI', 'PADAKEMBANG', 'SUKARATU', 'CISAYONG', 'SUKAHENING',
        'RAJAPOLAH', 'JAMANIS', 'CIAWI', 'KADIPATEN', 'PAGERAGEUNG',
        'SUKARESIK'], dtype=object),
 39)

In [678]:
merged_df['kategori'].unique(), merged_df['kategori'].nunique()

(array(['sarana_kesehatan', 'jumlah_sls', 'wabah_penyakit',
        'wabah_meninggal', 'tempat_ibadah', 'lembaga_kemasyarakatan',
        'bts', 'sinyal', 'pos', 'industri', 'perbankan', 'kud',
        'sarana_prasarana', 'linmas', 'bumdes'], dtype=object),
 15)

In [680]:
merged_df.isna().sum()

nama_kecamatan    0
nama_desa         0
kategori          0
jenis             0
jumlah            0
dtype: int64

In [681]:
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32292 entries, 0 to 32291
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   nama_kecamatan  32292 non-null  object
 1   nama_desa       32292 non-null  object
 2   kategori        32292 non-null  object
 3   jenis           32292 non-null  object
 4   jumlah          32292 non-null  int64
dtypes: int64(1), object(4)
memory usage: 1.2+ MB

## Save to Excel File

In [675]:
with pd.ExcelWriter('D:/Test/final_kcda.xlsx') as writer :
    merged_df.to_excel(writer, index =False)